benchmarking/config-comparison-results/go-db-dual-write-results.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: stress-test-optimized.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 2m15s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 1m45s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)

time="2025-09-12T19:58:43+01:00" level=info msg="Setting up optimized stress test..." source=console
time="2025-09-12T19:58:43+01:00" level=info msg="Note: This test assumes go-db is configured with -transaction-save=false" source=console
time="2025-09-12T19:58:43+01:00" level=info msg="Optimized stress test setup complete" source=console

running (0m01.0s), 002/100 VUs, 10 complete and 0 interrupted iterations
default   [   1% ] 002/100 VUs  0m01.0s/1m45.0s

running (0m02.0s), 003/100 VUs, 31 complete and 0 interrupted iterations
default   [   2% ] 003/100 VUs  0m02.0s/1m45.0s

running (0m03.0s), 004/100 VUs, 66 complete and 0 interrupted iterations
default   [   3% ] 004/100 VUs  0m03.0s/1m45.0s

running (0m04.0s), 006/100 VUs, 104 complete and 0 interrupted iterations
default   [   4% ] 006/100 VUs  0m04.0s/1m45.0s

running (0m05.0s), 007/100 VUs, 156 complete and 0 interrupted iterations
default   [   5% ] 007/100 VUs  0m05.0s/1m45.0s

running (0m06.0s), 008/100 VUs, 226 complete and 0 interrupted iterations
default   [   6% ] 008/100 VUs  0m06.0s/1m45.0s

running (0m07.0s), 009/100 VUs, 300 complete and 0 interrupted iterations
default   [   7% ] 009/100 VUs  0m07.0s/1m45.0s

running (0m08.0s), 011/100 VUs, 392 complete and 0 interrupted iterations
default   [   8% ] 011/100 VUs  0m08.0s/1m45.0s

running (0m09.0s), 012/100 VUs, 509 complete and 0 interrupted iterations
default   [   9% ] 012/100 VUs  0m09.0s/1m45.0s

running (0m10.0s), 013/100 VUs, 623 complete and 0 interrupted iterations
default   [   9% ] 013/100 VUs  0m10.0s/1m45.0s

running (0m11.0s), 014/100 VUs, 752 complete and 0 interrupted iterations
default   [  10% ] 014/100 VUs  0m11.0s/1m45.0s

running (0m12.0s), 016/100 VUs, 884 complete and 0 interrupted iterations
default   [  11% ] 016/100 VUs  0m12.0s/1m45.0s

running (0m13.0s), 017/100 VUs, 1021 complete and 0 interrupted iterations
default   [  12% ] 017/100 VUs  0m13.0s/1m45.0s

running (0m14.0s), 018/100 VUs, 1125 complete and 0 interrupted iterations
default   [  13% ] 018/100 VUs  0m14.0s/1m45.0s

running (0m15.0s), 019/100 VUs, 1248 complete and 0 interrupted iterations
default   [  14% ] 019/100 VUs  0m15.0s/1m45.0s

running (0m16.0s), 021/100 VUs, 1401 complete and 0 interrupted iterations
default   [  15% ] 021/100 VUs  0m16.0s/1m45.0s

running (0m17.0s), 023/100 VUs, 1561 complete and 0 interrupted iterations
default   [  16% ] 023/100 VUs  0m17.0s/1m45.0s

running (0m18.0s), 025/100 VUs, 1753 complete and 0 interrupted iterations
default   [  17% ] 025/100 VUs  0m18.0s/1m45.0s

running (0m19.0s), 027/100 VUs, 1931 complete and 0 interrupted iterations
default   [  18% ] 027/100 VUs  0m19.0s/1m45.0s

running (0m20.0s), 029/100 VUs, 2076 complete and 0 interrupted iterations
default   [  19% ] 029/100 VUs  0m20.0s/1m45.0s

running (0m21.0s), 031/100 VUs, 2235 complete and 0 interrupted iterations
default   [  20% ] 031/100 VUs  0m21.0s/1m45.0s

running (0m22.0s), 033/100 VUs, 2381 complete and 0 interrupted iterations
default   [  21% ] 033/100 VUs  0m22.0s/1m45.0s

running (0m23.0s), 035/100 VUs, 2544 complete and 0 interrupted iterations
default   [  22% ] 035/100 VUs  0m23.0s/1m45.0s

running (0m24.0s), 037/100 VUs, 2680 complete and 0 interrupted iterations
default   [  23% ] 037/100 VUs  0m24.0s/1m45.0s

running (0m25.0s), 039/100 VUs, 2825 complete and 0 interrupted iterations
default   [  24% ] 039/100 VUs  0m25.0s/1m45.0s

running (0m26.0s), 041/100 VUs, 2977 complete and 0 interrupted iterations
default   [  25% ] 041/100 VUs  0m26.0s/1m45.0s

running (0m27.0s), 043/100 VUs, 3128 complete and 0 interrupted iterations
default   [  26% ] 043/100 VUs  0m27.0s/1m45.0s

running (0m28.0s), 045/100 VUs, 3260 complete and 0 interrupted iterations
default   [  27% ] 045/100 VUs  0m28.0s/1m45.0s

running (0m29.0s), 047/100 VUs, 3406 complete and 0 interrupted iterations
default   [  28% ] 047/100 VUs  0m29.0s/1m45.0s

running (0m30.0s), 049/100 VUs, 3524 complete and 0 interrupted iterations
default   [  29% ] 049/100 VUs  0m30.0s/1m45.0s

running (0m31.0s), 051/100 VUs, 3641 complete and 0 interrupted iterations
default   [  29% ] 051/100 VUs  0m31.0s/1m45.0s

running (0m32.0s), 053/100 VUs, 3758 complete and 0 interrupted iterations
default   [  30% ] 053/100 VUs  0m32.0s/1m45.0s

running (0m33.0s), 054/100 VUs, 3871 complete and 0 interrupted iterations
default   [  31% ] 054/100 VUs  0m33.0s/1m45.0s

running (0m34.0s), 056/100 VUs, 4005 complete and 0 interrupted iterations
default   [  32% ] 056/100 VUs  0m34.0s/1m45.0s

running (0m35.0s), 058/100 VUs, 4132 complete and 0 interrupted iterations
default   [  33% ] 058/100 VUs  0m35.0s/1m45.0s

running (0m36.0s), 059/100 VUs, 4221 complete and 0 interrupted iterations
default   [  34% ] 059/100 VUs  0m36.0s/1m45.0s

running (0m37.0s), 061/100 VUs, 4329 complete and 0 interrupted iterations
default   [  35% ] 061/100 VUs  0m37.0s/1m45.0s

running (0m38.0s), 063/100 VUs, 4432 complete and 0 interrupted iterations
default   [  36% ] 063/100 VUs  0m38.0s/1m45.0s

running (0m39.0s), 064/100 VUs, 4554 complete and 0 interrupted iterations
default   [  37% ] 064/100 VUs  0m39.0s/1m45.0s

running (0m40.0s), 066/100 VUs, 4652 complete and 0 interrupted iterations
default   [  38% ] 066/100 VUs  0m40.0s/1m45.0s

running (0m41.0s), 068/100 VUs, 4760 complete and 0 interrupted iterations
default   [  39% ] 068/100 VUs  0m41.0s/1m45.0s

running (0m42.0s), 069/100 VUs, 4858 complete and 0 interrupted iterations
default   [  40% ] 069/100 VUs  0m42.0s/1m45.0s

running (0m43.0s), 071/100 VUs, 4950 complete and 0 interrupted iterations
default   [  41% ] 071/100 VUs  0m43.0s/1m45.0s

running (0m44.0s), 073/100 VUs, 5055 complete and 0 interrupted iterations
default   [  42% ] 073/100 VUs  0m44.0s/1m45.0s

running (0m45.0s), 074/100 VUs, 5128 complete and 0 interrupted iterations
default   [  43% ] 074/100 VUs  0m45.0s/1m45.0s

running (0m46.0s), 076/100 VUs, 5207 complete and 0 interrupted iterations
default   [  44% ] 076/100 VUs  0m46.0s/1m45.0s

running (0m47.0s), 078/100 VUs, 5276 complete and 0 interrupted iterations
default   [  45% ] 078/100 VUs  0m47.0s/1m45.0s

running (0m48.0s), 079/100 VUs, 5353 complete and 0 interrupted iterations
default   [  46% ] 079/100 VUs  0m48.0s/1m45.0s

running (0m49.0s), 081/100 VUs, 5404 complete and 0 interrupted iterations
default   [  47% ] 081/100 VUs  0m49.0s/1m45.0s

running (0m50.0s), 083/100 VUs, 5483 complete and 0 interrupted iterations
default   [  48% ] 083/100 VUs  0m50.0s/1m45.0s

running (0m51.0s), 084/100 VUs, 5548 complete and 0 interrupted iterations
default   [  49% ] 084/100 VUs  0m51.0s/1m45.0s

running (0m52.0s), 086/100 VUs, 5604 complete and 0 interrupted iterations
default   [  49% ] 086/100 VUs  0m52.0s/1m45.0s

running (0m53.0s), 088/100 VUs, 5642 complete and 0 interrupted iterations
default   [  50% ] 088/100 VUs  0m53.0s/1m45.0s

running (0m54.0s), 089/100 VUs, 5670 complete and 0 interrupted iterations
default   [  51% ] 089/100 VUs  0m54.0s/1m45.0s

running (0m55.0s), 091/100 VUs, 5747 complete and 0 interrupted iterations
default   [  52% ] 091/100 VUs  0m55.0s/1m45.0s

running (0m56.0s), 093/100 VUs, 5837 complete and 0 interrupted iterations
default   [  53% ] 093/100 VUs  0m56.0s/1m45.0s

running (0m57.0s), 094/100 VUs, 5911 complete and 0 interrupted iterations
default   [  54% ] 094/100 VUs  0m57.0s/1m45.0s

running (0m58.0s), 096/100 VUs, 5958 complete and 0 interrupted iterations
default   [  55% ] 096/100 VUs  0m58.0s/1m45.0s

running (0m59.0s), 098/100 VUs, 6074 complete and 0 interrupted iterations
default   [  56% ] 098/100 VUs  0m59.0s/1m45.0s

running (1m00.0s), 099/100 VUs, 6153 complete and 0 interrupted iterations
default   [  57% ] 099/100 VUs  1m00.0s/1m45.0s

running (1m01.0s), 100/100 VUs, 6203 complete and 0 interrupted iterations
default   [  58% ] 100/100 VUs  1m01.0s/1m45.0s

running (1m02.0s), 100/100 VUs, 6265 complete and 0 interrupted iterations
default   [  59% ] 100/100 VUs  1m02.0s/1m45.0s

running (1m03.0s), 100/100 VUs, 6344 complete and 0 interrupted iterations
default   [  60% ] 100/100 VUs  1m03.0s/1m45.0s

running (1m04.0s), 100/100 VUs, 6426 complete and 0 interrupted iterations
default   [  61% ] 100/100 VUs  1m04.0s/1m45.0s

running (1m05.0s), 100/100 VUs, 6497 complete and 0 interrupted iterations
default   [  62% ] 100/100 VUs  1m05.0s/1m45.0s

running (1m06.0s), 100/100 VUs, 6570 complete and 0 interrupted iterations
default   [  63% ] 100/100 VUs  1m06.0s/1m45.0s

running (1m07.0s), 100/100 VUs, 6661 complete and 0 interrupted iterations
default   [  64% ] 100/100 VUs  1m07.0s/1m45.0s

running (1m08.0s), 100/100 VUs, 6710 complete and 0 interrupted iterations
default   [  65% ] 100/100 VUs  1m08.0s/1m45.0s

running (1m09.0s), 100/100 VUs, 6792 complete and 0 interrupted iterations
default   [  66% ] 100/100 VUs  1m09.0s/1m45.0s

running (1m10.0s), 100/100 VUs, 6850 complete and 0 interrupted iterations
default   [  67% ] 100/100 VUs  1m10.0s/1m45.0s

running (1m11.0s), 100/100 VUs, 6915 complete and 0 interrupted iterations
default   [  68% ] 100/100 VUs  1m11.0s/1m45.0s

running (1m12.0s), 100/100 VUs, 6977 complete and 0 interrupted iterations
default   [  69% ] 100/100 VUs  1m12.0s/1m45.0s

running (1m13.0s), 100/100 VUs, 7029 complete and 0 interrupted iterations
default   [  69% ] 100/100 VUs  1m13.0s/1m45.0s

running (1m14.0s), 100/100 VUs, 7084 complete and 0 interrupted iterations
default   [  70% ] 100/100 VUs  1m14.0s/1m45.0s

running (1m15.0s), 100/100 VUs, 7146 complete and 0 interrupted iterations
default   [  71% ] 100/100 VUs  1m15.0s/1m45.0s

running (1m16.0s), 100/100 VUs, 7182 complete and 0 interrupted iterations
default   [  72% ] 100/100 VUs  1m16.0s/1m45.0s

running (1m17.0s), 100/100 VUs, 7235 complete and 0 interrupted iterations
default   [  73% ] 100/100 VUs  1m17.0s/1m45.0s

running (1m18.0s), 100/100 VUs, 7295 complete and 0 interrupted iterations
default   [  74% ] 100/100 VUs  1m18.0s/1m45.0s

running (1m19.0s), 100/100 VUs, 7361 complete and 0 interrupted iterations
default   [  75% ] 100/100 VUs  1m19.0s/1m45.0s

running (1m20.0s), 100/100 VUs, 7425 complete and 0 interrupted iterations
default   [  76% ] 100/100 VUs  1m20.0s/1m45.0s

running (1m21.0s), 100/100 VUs, 7488 complete and 0 interrupted iterations
default   [  77% ] 100/100 VUs  1m21.0s/1m45.0s

running (1m22.0s), 100/100 VUs, 7544 complete and 0 interrupted iterations
default   [  78% ] 100/100 VUs  1m22.0s/1m45.0s

running (1m23.0s), 100/100 VUs, 7599 complete and 0 interrupted iterations
default   [  79% ] 100/100 VUs  1m23.0s/1m45.0s

running (1m24.0s), 100/100 VUs, 7663 complete and 0 interrupted iterations
default   [  80% ] 100/100 VUs  1m24.0s/1m45.0s

running (1m25.0s), 100/100 VUs, 7707 complete and 0 interrupted iterations
default   [  81% ] 100/100 VUs  1m25.0s/1m45.0s

running (1m26.0s), 100/100 VUs, 7787 complete and 0 interrupted iterations
default   [  82% ] 100/100 VUs  1m26.0s/1m45.0s

running (1m27.0s), 100/100 VUs, 7851 complete and 0 interrupted iterations
default   [  83% ] 100/100 VUs  1m27.0s/1m45.0s

running (1m28.0s), 100/100 VUs, 7888 complete and 0 interrupted iterations
default   [  84% ] 100/100 VUs  1m28.0s/1m45.0s

running (1m29.0s), 100/100 VUs, 7941 complete and 0 interrupted iterations
default   [  85% ] 100/100 VUs  1m29.0s/1m45.0s

running (1m30.0s), 100/100 VUs, 7979 complete and 0 interrupted iterations
default   [  86% ] 100/100 VUs  1m30.0s/1m45.0s

running (1m31.0s), 100/100 VUs, 8051 complete and 0 interrupted iterations
default   [  87% ] 100/100 VUs  1m31.0s/1m45.0s

running (1m32.0s), 097/100 VUs, 8101 complete and 0 interrupted iterations
default   [  88% ] 097/100 VUs  1m32.0s/1m45.0s

running (1m33.0s), 093/100 VUs, 8161 complete and 0 interrupted iterations
default   [  89% ] 093/100 VUs  1m33.0s/1m45.0s

running (1m34.0s), 091/100 VUs, 8207 complete and 0 interrupted iterations
default   [  89% ] 091/100 VUs  1m34.0s/1m45.0s

running (1m35.0s), 077/100 VUs, 8287 complete and 0 interrupted iterations
default   [  90% ] 077/100 VUs  1m35.0s/1m45.0s

running (1m36.0s), 074/100 VUs, 8332 complete and 0 interrupted iterations
default   [  91% ] 074/100 VUs  1m36.0s/1m45.0s

running (1m37.0s), 064/100 VUs, 8382 complete and 0 interrupted iterations
default   [  92% ] 064/100 VUs  1m37.0s/1m45.0s

running (1m38.0s), 053/100 VUs, 8454 complete and 0 interrupted iterations
default   [  93% ] 053/100 VUs  1m38.0s/1m45.0s

running (1m39.0s), 044/100 VUs, 8508 complete and 0 interrupted iterations
default   [  94% ] 044/100 VUs  1m39.0s/1m45.0s

running (1m40.0s), 038/100 VUs, 8578 complete and 0 interrupted iterations
default   [  95% ] 038/100 VUs  1m40.0s/1m45.0s

running (1m41.0s), 032/100 VUs, 8633 complete and 0 interrupted iterations
default   [  96% ] 032/100 VUs  1m41.0s/1m45.0s

running (1m42.0s), 023/100 VUs, 8678 complete and 0 interrupted iterations
default   [  97% ] 023/100 VUs  1m42.0s/1m45.0s

running (1m43.0s), 016/100 VUs, 8727 complete and 0 interrupted iterations
default   [  98% ] 016/100 VUs  1m43.0s/1m45.0s

running (1m44.0s), 009/100 VUs, 8772 complete and 0 interrupted iterations
default   [  99% ] 009/100 VUs  1m44.0s/1m45.0s

running (1m45.0s), 001/100 VUs, 8806 complete and 0 interrupted iterations
default   [ 100% ] 001/100 VUs  1m45.0s/1m45.0s
time="2025-09-12T20:00:28+01:00" level=info msg="Optimized stress test teardown complete" source=console


  █ THRESHOLDS 

    errors
    ✓ 'rate<0.01' rate=0.00%

    http_req_duration
    ✗ 'p(95)<500' p(95)=3.76s

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 8807    83.756551/s
    checks_succeeded...: 100.00% 8807 out of 8807
    checks_failed......: 0.00%   0 out of 8807

    ✓ stress find status is 200
    ✓ stress insert status is 201
    ✓ stress update status is 200 or 404
    ✓ stress batch insert status is 201
    ✓ stress get by id status is 200 or 404

    CUSTOM
    errors.........................: 0.00%  0 out of 0

    HTTP
    http_req_duration..............: avg=668.21ms min=1.14ms med=103.36ms max=5.4s  p(90)=2.72s p(95)=3.76s
      { expected_response:true }...: avg=668.21ms min=1.14ms med=103.36ms max=5.4s  p(90)=2.72s p(95)=3.76s
    http_req_failed................: 0.00%  0 out of 8810
    http_reqs......................: 8810   83.785082/s

    EXECUTION
    iteration_duration.............: avg=768.14ms min=4.17ms med=219.1ms  max=5.52s p(90)=2.82s p(95)=3.85s
    iterations.....................: 8807   83.756551/s
    vus............................: 1      min=1         max=100
    vus_max........................: 100    min=100       max=100

    NETWORK
    data_received..................: 11 MB  107 kB/s
    data_sent......................: 3.1 MB 29 kB/s



running (1m45.1s), 000/100 VUs, 8807 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  1m45s
time="2025-09-12T20:00:28+01:00" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"